project/src/Catalogs/Свойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Свойства</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Объекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индексирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыЧисла_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыЧисла_Точность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыЧисла_Неотрицательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыСтроки_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыСтроки_Фиксированная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалификаторыДаты_Состав</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторегистрация</Name>
					<Comment>Признак авторегистрации элемента состава плана обмена; Истина – авторегистрация разрешена; Ложь – запрещена</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоВышестоящегоРелиза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Типы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/CommonForms/ВыборОбъектаИлиСвойства/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыФормы = Параметры;
	РежимРаботы = ПараметрыФормы.РежимРаботы;
	ВерсияФормата = Неопределено;
	Если ПараметрыФормы.Свойство("ВерсияФормата") Тогда
		ПереданаВерсияФормата = Истина;
		ВерсияФормата = ПараметрыФормы.ВерсияФормата;
	КонецЕсли;
	ТекущаяСтрока = ПараметрыФормы.ТекущаяСтрока;
	ПараметрыФормы.Свойство("ДляПКО", ДляПКО);
	ПараметрыФормы.Свойство("ДляПКПД", ДляПКПД);
	ПараметрыФормы.Свойство("ДляПРО", ДляПРО);
	Элементы.СтраницаСвойстваФормата.Видимость = Ложь;
	Элементы.СтраницаОбъектыФормата.Видимость = Ложь;
	Элементы.СтраницаОбъектыКонфигурации.Видимость = Ложь;
	Элементы.СтраницаСвойстваКонфигурации.Видимость = Ложь;
	Если РежимРаботы = "ОбъектФормата" Тогда
		МассивКонвертаций = Неопределено;
		ПараметрыФормы.Свойство("МассивКонвертаций", МассивКонвертаций);
		ЗаполнитьОбъектыФормата(МассивКонвертаций);
		Элементы.СтраницаОбъектыФормата.Видимость = Истина;
		Заголовок = НСтр("ru='Объекты формата'");
	ИначеЕсли РежимРаботы = "СвойствоФормата" Тогда
		ОбъектФормата = "";
		ПараметрыФормы.Свойство("ОбъектФормата", ОбъектФормата);
		ТаблицаСвойствФормата = Неопределено;
		ПараметрыФормы.Свойство("ТаблицаСвойствФормата", ТаблицаСвойствФормата);
		ЗаполнитьСвойстваФормата(ТаблицаСвойствФормата);
		Элементы.СтраницаСвойстваФормата.Видимость = Истина;
		Заголовок = НСтр("ru='Свойства формата'");
	ИначеЕсли РежимРаботы = "ОбъектКонфигурации" Тогда
		Если ДляПРО Тогда
			ДанныеФильтра = Новый Структура("ПланОбмена, Конфигурация");
			ЗаполнитьЗначенияСвойств(ДанныеФильтра, ПараметрыФормы);
			ЗаполнитьОбъектыКонфигурации(Неопределено, Неопределено, ДанныеФильтра);
		Иначе
			МассивКонвертаций = Неопределено;
			МассивКонфигураций = Неопределено;
			ВедущаяКонфигурация = Неопределено;
			ПараметрыФормы.Свойство("МассивКонфигураций", МассивКонфигураций);
			ПараметрыФормы.Свойство("МассивКонвертаций", МассивКонвертаций);
			ПараметрыФормы.Свойство("ВедущаяКонфигурация", ВедущаяКонфигурация);
			ЗаполнитьОбъектыКонфигурации(МассивКонфигураций, МассивКонвертаций,,ВедущаяКонфигурация);
		КонецЕсли;
		Элементы.СтраницаОбъектыКонфигурации.Видимость = Истина;
		Заголовок = НСтр("ru='Объекты конфигурации'");
	ИначеЕсли РежимРаботы = "СвойствоКонфигурации" Тогда
		ТаблицаСвойствКонфигурации = Неопределено;
		ОтборПоТипу = Неопределено;
		ОбъектКонфигурации = Неопределено;
		ПараметрыФормы.Свойство("ТаблицаСвойствКонфигурации", ТаблицаСвойствКонфигурации);
		ПараметрыФормы.Свойство("ОтборПоТипу", ОтборПоТипу);
		Если ДляПРО Тогда
			ПараметрыФормы.Свойство("Конфигурация", ВедущаяКонфигурация);
		КонецЕсли;
		ЗаполнитьСвойстваКонфигурации(ТаблицаСвойствКонфигурации, ОтборПоТипу);
		Элементы.СтраницаСвойстваКонфигурации.Видимость = Истина;
		Элементы.ПоказатьВложенныеРеквизиты.Видимость = ДляПРО И ЗначениеЗаполнено(ВедущаяКонфигурация);
		Заголовок = НСтр("ru='Свойства конфигурации'");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыФорматаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("ОбъектыФормата", "Наименование");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыФорматаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("ОбъектыФормата", "Наименование");
КонецПроцедуры

&НаКлиенте
Процедура СвойстваФорматаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("СвойстваФормата");
КонецПроцедуры

&НаКлиенте
Процедура СвойстваФорматаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("СвойстваФормата");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыКонфигурацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("ОбъектыКонфигурации", "Наименование", Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыКонфигурацииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("ОбъектыКонфигурации", "Наименование", Истина);
КонецПроцедуры

&НаКлиенте
Процедура СвойстваКонфигурацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("СвойстваКонфигурации",,Истина);
КонецПроцедуры

&НаКлиенте
Процедура СвойстваКонфигурацииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОбработатьВыборИзСписка("СвойстваКонфигурации",,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВложенныеРеквизиты(Команда)
	ВложенныйРеквизитРодитель = ?(ЗначениеЗаполнено(ВложенныйРеквизитРодитель), СокрЛП(ВложенныйРеквизитРодитель) + ".", "") + СокрЛП(Элементы.СвойстваКонфигурации.ТекущиеДанные.Имя);
	ПоказатьВложенныеРеквизитыНаСервере(Элементы.СвойстваКонфигурации.ТекущиеДанные.Тип);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьОбъектыФормата(МассивКонвертаций)
	Если ПереданаВерсияФормата Тогда
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовФормата(ОбъектыФормата, Неопределено, Ложь, Ложь, ВерсияФормата);
	Иначе
		КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовФормата(ОбъектыФормата, МассивКонвертаций, ДляПКО, ДляПКПД);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		СтрокиТаб = ОбъектыФормата.НайтиСтроки(Новый Структура("Наименование", ТекущаяСтрока));
		Если СтрокиТаб.Количество() > 0 Тогда
			ИдСтроки = СтрокиТаб[0].ПолучитьИдентификатор();
			Элементы.ОбъектыФормата.ТекущаяСтрока = ИдСтроки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваФормата(ТаблицаСвойствФормата)
	Если ТаблицаСвойствФормата <> Неопределено Тогда
		// Уже готова таблица свойств (вызов из формы редактирования ПКС).
		Для Каждого СтрТаб Из ТаблицаСвойствФормата Цикл
			СтрНов = СвойстваФормата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрНов, СтрТаб);
		КонецЦикла;
	Иначе
		ФильтрСвойств = Новый Структура("ОбъектФормата, ЭтоГруппа", ОбъектФормата, Ложь);
		Если ПереданаВерсияФормата Тогда
			ФильтрСвойств.Вставить("ВерсияФормата", ВерсияФормата);
			КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствФормата(СвойстваФормата, Неопределено, ФильтрСвойств);
		Иначе
			КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокСвойствФормата(СвойстваФормата, МассивКонвертаций, ФильтрСвойств);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		СтрокиТаб = СвойстваФормата.НайтиСтроки(Новый Структура("Имя", ТекущаяСтрока));
		Если СтрокиТаб.Количество() > 0 Тогда
			ИдСтроки = СтрокиТаб[0].ПолучитьИдентификатор();
			Элементы.СвойстваФормата.ТекущаяСтрока = ИдСтроки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваКонфигурации(ТаблицаСвойствКонфигурации, ОтборПоТипу)
	СоставнойТип = Ложь;
	ОтборПоТипам = Неопределено;
	Если СтрНайти(ОтборПоТипу, ",") > 0 Тогда
		СоставнойТип = Истина;
		ОтборПоТипам = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ОтборПоТипу,",", Истина);
	КонецЕсли;
	Для Каждого СтрТаб Из ТаблицаСвойствКонфигурации Цикл
		Если ОтборПоТипу <> Неопределено Тогда
			ПропуститьСтроку = Ложь;
			Если ОтборПоТипу = "ПростойТип" Тогда
				ПропуститьСтроку = (СтрНайти(СтрТаб.Тип, "Дата") + СтрНайти(СтрТаб.Тип, "Булево")
					+ СтрНайти(СтрТаб.Тип, "Строка") + СтрНайти(СтрТаб.Тип, "Число") = 0);
			ИначеЕсли СтрНайти(ОтборПоТипу, "Дата") Тогда
				// для отбора Дата и время тип Дата тоже должен попадать.
				ПропуститьСтроку = (СтрНайти(СтрТаб.Тип, "Дата") = 0); 
			Иначе
				Если СоставнойТип Тогда
					ПропуститьСтроку = Истина;
					Для Каждого локОтбор Из ОтборПоТипам Цикл
						Если СтрНайти(СтрТаб.Тип, локОтбор) > 0 Тогда
							ПропуститьСтроку = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					ПропуститьСтроку = (СтрНайти(СтрТаб.Тип, ОтборПоТипу) = 0);
				КонецЕсли;
			КонецЕсли;
			Если ПропуститьСтроку Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		СтрНов = СвойстваКонфигурации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНов, СтрТаб);
	КонецЦикла;
	Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		СтрокиТаб = СвойстваКонфигурации.НайтиСтроки(Новый Структура("Имя", ТекущаяСтрока));
		Если СтрокиТаб.Количество() > 0 Тогда
			ИдСтроки = СтрокиТаб[0].ПолучитьИдентификатор();
			Элементы.СвойстваКонфигурации.ТекущаяСтрока = ИдСтроки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыКонфигурации(Конфигурации, Конвертации, КонфигурацияИПланОбмена = Неопределено, ВедущаяКонфигурация = Неопределено)
	ОбластьПрименения = Новый Структура("ДляПКО, ДляПКПД, ДляПРО", ДляПКО, ДляПКПД, ДляПРО);
	ДанныеФильтра = Неопределено;
	Если Конфигурации = Неопределено И Конвертации <> Неопределено Тогда
		ДанныеФильтра = КонвертацияДанныхXDTOВызовСервера.ПолучитьКонфигурацииДляКонвертаций(Конвертации);
	ИначеЕсли ВедущаяКонфигурация <> Неопределено И ВедущаяКонфигурация <> Справочники.Релизы.ПустаяСсылка() Тогда
		ДанныеФильтра = ВедущаяКонфигурация;
	ИначеЕсли Конфигурации <> Неопределено Тогда
		ДанныеФильтра = Конфигурации;
	Иначе
		ДанныеФильтра = КонфигурацияИПланОбмена;
	КонецЕсли;
	КонвертацияДанныхXDTOВызовСервера.ЗаполнитьСписокОбъектовКонфигурации(ОбъектыКонфигурации, ДанныеФильтра, ОбластьПрименения);
	Если ЗначениеЗаполнено(ТекущаяСтрока) Тогда
		Если ТипЗнч(ТекущаяСтрока) = Тип("Строка") Тогда
			СтрокиТаб = ОбъектыКонфигурации.НайтиСтроки(Новый Структура("Наименование", ТекущаяСтрока));
		Иначе
			СтрокиТаб = ОбъектыКонфигурации.НайтиСтроки(Новый Структура("Ссылка", ТекущаяСтрока));
		КонецЕсли;	
		Если СтрокиТаб.Количество() > 0 Тогда
			ИдСтроки = СтрокиТаб[0].ПолучитьИдентификатор();
			Элементы.ОбъектыКонфигурации.ТекущаяСтрока = ИдСтроки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборИзСписка(ИмяТабПоля, ИмяКолонкиТабПоля = "Имя", ЕстьСсылка = Ложь)
	Если ДляПРО И РежимРаботы = "СвойствоКонфигурации" Тогда
		ТекущиеДанные = Элементы[ИмяТабПоля].ТекущиеДанные;
		ТекущееЗначение = Новый Структура("Имя, Тип, Ссылка", ТекущиеДанные.Имя, ТекущиеДанные.Тип, ТекущиеДанные.Ссылка);
	ИначеЕсли ЕстьСсылка Тогда
		ТекущееЗначение = Новый Структура();
		ТекущееЗначение.Вставить(ИмяКолонкиТабПоля, Элементы[ИмяТабПоля].ТекущиеДанные[ИмяКолонкиТабПоля]);
		ТекущееЗначение.Вставить("Ссылка", Элементы[ИмяТабПоля].ТекущиеДанные.Ссылка);
	Иначе
		ТекущееЗначение = Элементы[ИмяТабПоля].ТекущиеДанные[ИмяКолонкиТабПоля];
	КонецЕсли;
	Закрыть(ТекущееЗначение);
КонецПроцедуры

&НаСервере
Процедура ПоказатьВложенныеРеквизитыНаСервере(Знач ТипСтрокой)
	Если СтрНайти(ТипСтрокой, "Ссылка.") = 0 Тогда
		Возврат;
	КонецЕсли;
	ПозицияРазделителя = СтрНайти(ТипСтрокой, ",");
	Если ПозицияРазделителя > 0 Тогда
		ТипСтрокой = Лев(ТипСтрокой, ПозицияРазделителя-1);
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Свойства.Наименование КАК Имя,
	|	ВЫРАЗИТЬ(Свойства.ТипыСтрокой КАК СТРОКА(1000)) КАК Тип,
	|	Свойства.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Свойства КАК Свойства
	|ГДЕ
	|	Свойства.Владелец.Наименование = &ОбъектКонфигурацииИмя
	|	И Свойства.Владелец.Владелец = &Конфигурация
	|	И Свойства.ПометкаУдаления = ЛОЖЬ
	|	И Свойства.Родитель = ЗНАЧЕНИЕ(Справочник.Свойства.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
    Запрос.УстановитьПараметр("Конфигурация", ВедущаяКонфигурация);
	Запрос.УстановитьПараметр("ОбъектКонфигурацииИмя", ТипСтрокой);
	СвойстваКонфигурации.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НовСтр = СвойстваКонфигурации.Добавить();
		НовСтр.Имя = ВложенныйРеквизитРодитель + "." + Выборка.Имя;
		ЗаполнитьЗначенияСвойств(НовСтр, Выборка,,"Имя");
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
